УслугиЛокально/src/Documents/Услуги/Услуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Услуги</name>
  <registerRecords>InformationRegister.Услуги</registerRecords>
  <registerRecords>AccumulationRegister.РасходыУслуг</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лицевой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛицевойСчетВода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛицевойСчетгаз</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛицевойСчетМусор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛицевойСчетСвет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НовВода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НовГаз</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НовСвет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОплаитьГаз</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОплаитьСвет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОплатитьВода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОплаченоВода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОплаченоГаз</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОплаченоМусор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОплаченоСвет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазницаВода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазницаГаз</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазницаСвет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтВода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтГаз</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтСвет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>сумГаз</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СумСвет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТарифВода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТарифГаз</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТарифНаМусор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТарифСвет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеКартинки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПлатежей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СправочникФайлы</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>СправочникФайлыСвет</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>СправочникФайлыМусор</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>СправочникФайлыГаз</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоСуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СправочникФайлыВОда</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоСписка</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаМесяца</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОплаченоИнтернет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛицевойСчетИнтернет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Реквизит1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТарифНаинтернет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключаяИнтернет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.ХранимыеФайлы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЛицевыеСчета</name>
    <attributes>
      <name>ЛС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтГаз</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НовГаз</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтСвет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НовСвет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтВода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НовВода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УслугиЛокально/src/InformationRegisters/ТарифыНаУслуги/ТарифыНаУслуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТарифыНаУслуги</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ТарифНаГаз</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифНаЭлектроэнергию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифНаВоду</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифНаМусор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифНаИнтернет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДатаТарифа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УслугиЛокально/src/InformationRegisters/Услуги/Услуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Услуги</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Газ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Свет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Вода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РасходГаз</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РасходСвет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РасходВода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УслугиЛокально/src/Documents/Услуги/Forms/ФормаДокумента/Module.bsl
&НаСервере
Функция ПолучитьТарифы(ОтчетнаяДата)
///Новый Комментарий
	Если месяц(ОтчетнаяДата) < 7 Тогда
		ДатаДляЗапроса = Дата(Год(ОтчетнаяДата), 01, 01);
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТарифыНаУслуги.Регистратор КАК Регистратор,
		|	ТарифыНаУслуги.ДатаТарифа КАК ДатаТарифа,
		|	ТарифыНаУслуги.ТарифНаГаз КАК ТарифНаГаз,
		|	ТарифыНаУслуги.ТарифНаЭлектроэнергию КАК ТарифНаЭлектроэнергию,
		|	ТарифыНаУслуги.ТарифНаВоду КАК ТарифНаВоду,
		|	ТарифыНаУслуги.ТарифНаМусор КАК ТарифНаМусор,
		|	ТарифыНаУслуги.ТарифНаИнтернет КАК ТарифНаИнтернет
		|ИЗ
		|	РегистрСведений.ТарифыНаУслуги КАК ТарифыНаУслуги
		|ГДЕ
		|	ТарифыНаУслуги.ДатаТарифа = &ОтчетнаяДата";
		Запрос.УстановитьПараметр("ОтчетнаяДата", ДатаДляЗапроса);
		РезультатЗапроса = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Тарифы = Новый Структура;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Тарифы.Вставить("ТарифНаГаз", ВыборкаДетальныеЗаписи.ТарифНаГаз);
			Тарифы.Вставить("ТарифНаЭлектроэнергию", ВыборкаДетальныеЗаписи.ТарифНаЭлектроэнергию);
			Тарифы.Вставить("ТарифНаВоду", ВыборкаДетальныеЗаписи.ТарифНаВоду);
			Тарифы.Вставить("ТарифНаМусор", ВыборкаДетальныеЗаписи.ТарифНаМусор);
			Тарифы.Вставить("ТарифНаИнтернет", ВыборкаДетальныеЗаписи.ТарифНаИнтернет);
		КонецЦикла;

	Иначе

		ДатаДляЗапроса = Дата(Год(ОтчетнаяДата), 06, 01);
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТарифыНаУслуги.Регистратор КАК Регистратор,
		|	ТарифыНаУслуги.ДатаТарифа КАК ДатаТарифа,
		|	ТарифыНаУслуги.ТарифНаГаз КАК ТарифНаГаз,
		|	ТарифыНаУслуги.ТарифНаЭлектроэнергию КАК ТарифНаЭлектроэнергию,
		|	ТарифыНаУслуги.ТарифНаВоду КАК ТарифНаВоду,
		|	ТарифыНаУслуги.ТарифНаМусор КАК ТарифНаМусор,
		|	ТарифыНаУслуги.ТарифНаИнтернет КАК ТарифНаИнтернет
		|ИЗ
		|	РегистрСведений.ТарифыНаУслуги КАК ТарифыНаУслуги
		|ГДЕ
		|	ТарифыНаУслуги.ДатаТарифа = &ОтчетнаяДата";
		Запрос.УстановитьПараметр("ОтчетнаяДата", ДатаДляЗапроса);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Сообщить("Пустой запрос нет записей о тарифе на вторую половину года");
		Иначе
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			Тарифы = Новый Структура;
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Тарифы.Вставить("ТарифНаГаз", ВыборкаДетальныеЗаписи.ТарифНаГаз);
				Тарифы.Вставить("ТарифНаЭлектроэнергию", ВыборкаДетальныеЗаписи.ТарифНаЭлектроэнергию);
				Тарифы.Вставить("ТарифНаВоду", ВыборкаДетальныеЗаписи.ТарифНаВоду);
				Тарифы.Вставить("ТарифНаМусор", ВыборкаДетальныеЗаписи.ТарифНаМусор);
				Тарифы.Вставить("ТарифНаИнтернет", ВыборкаДетальныеЗаписи.ТарифНаИнтернет);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Возврат тарифы;
КонецФункции
&НаКлиенте
Процедура ВXml(Команда)
	ВXmlНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НовВодаПриИзменении(Элемент)
	НовГазПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура СтВодаПриИзменении(Элемент)
	НовГазПриИзменении(Элемент);
КонецПроцедуры
&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ДатаРасчета = Объект.ДатаНачалаМесяца;

		ПолучитьПоказанияНаСервере(ДатаРасчета);
		ОтчетнаяДата = ДатаРасчета;
		ЗаполнитьТарифы(ОтчетнаяДата);
	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СтГазПриИзменении(Элемент)
	НовГазПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура НовГазПриИзменении(Элемент)
	ОтчетнаяДата = Объект.ДатаНачалаМесяца;
	Тарифы = Получитьтарифы(ОтчетнаяДата);

	ОбщегоНазначенияКлиент.ПересчитатьРазницыИСуммы(Объект, тарифы);
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	Если Объект.ДатаНачалаМесяца = Неопределено Тогда
		ДатаПредыдущегоМесяца = Дата(Год(ТекущаяДата()), месяц(ТекущаяДата()), 01);
		Объект.ДатаНачалаМесяца = ДатаПредыдущегоМесяца;
		МесяцСтрокой = Формат(Объект.ДатаНачалаМесяца, "ДФ='MMMM гггг'") + " г.";
	Иначе
		МесяцСтрокой = Формат(Объект.ДатаНачалаМесяца, "ДФ='MMMM гггг'") + " г.";

		Объект.ЛицевойСчетСвет = 701028908;
		Объект.ЛицевойСчетгаз= 7701001616;
		Объект.ЛицевойСчетВода = 37311;
		Объект.ЛицевойСчетМусор = 142000024050;
		Объект.ЛицевойСчетИнтернет = 407002992967;

	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
	ОтчетнаяДата = Объект.ДатаНачалаМесяца;
	ЗаполнитьТарифы(ОтчетнаяДата);
КонецПроцедуры

&НаСервере
Процедура ВXmlНаСервере()
	Запись=Новый ЗаписьXML;
	Запись.ОткрытьФайл("c:\1\document.xml");
	Запись.ЗаписатьОбъявлениеXML();
	Запись.ЗаписатьНачалоЭлемента("Корневой");
	Запись.ЗаписатьАтрибут("Доумент", "Услуги");
	Запись.ЗаписатьКомментарий("Краткая информация об услугах");

	Выборка=Документы.Услуги.Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись.ЗаписатьНачалоЭлемента("Элемент");
		Запись.ЗаписатьАтрибут("Номер", Строка(Выборка.Номер));
		Запись.ЗаписатьАтрибут("Дата", Строка(Выборка.Дата));
		Запись.ЗаписатьАтрибут("СтГаз", Строка(Выборка.СтГаз));
		Запись.ЗаписатьАтрибут("НовГаз", Строка(Выборка.НовГаз));

		Запись.ЗаписатьКонецЭлемента();
	КонецЦикла;
	Запись.ЗаписатьКонецЭлемента();
	Запись.Закрыть();
КонецПроцедуры
&НаКлиенте
Процедура СтСветПриИзменении(Элемент)
	НовГазПриИзменении(Элемент);
КонецПроцедуры
&НаКлиенте
Процедура НовСветПриИзменении(Элемент)
	НовГазПриИзменении(Элемент);

КонецПроцедуры
&НаСервере
Процедура ПолучитьПоказанияНаСервере(ДатаРасчета)
	Если месяц(ДатаРасчета) <> 12 И месяц(ДатаРасчета) <> 1 Тогда
		Запрос1 = Новый Запрос;
		Запрос1.Текст =
		"ВЫБРАТЬ
		|	Услуги.Период КАК Период,
		|	Услуги.ДатаДокумента КАК ДатаДокумента,
		|	ЕСТЬNULL(Услуги.Газ, 0) КАК Газ,
		|	ЕСТЬNULL(Услуги.Свет, 0) КАК Свет,
		|	ЕСТЬNULL(Услуги.Вода, 0) КАК Вода
		|ИЗ
		|	РегистрСведений.Услуги КАК Услуги
		|ГДЕ
		|	МЕСЯЦ(Услуги.ДатаДокумента) = месяц(&ДатаДокумента)-1
		|	И ГОД(Услуги.ДатаДокумента) = ГОД(&ДатаДокумента)";
		Запрос1.УстановитьПараметр("ДатаДокумента", ДатаРасчета);
		РезультатЗапроса1 = Запрос1.Выполнить();

		Если РезультатЗапроса1.Пустой() Тогда
			Сообщить("данных за предыдущий период нет!!!запрос пустой");

		Иначе

			ВыборкаДетальныеЗаписи1 = РезультатЗапроса1.Выбрать();

			Пока ВыборкаДетальныеЗаписи1.Следующий() Цикл
				объект.СтСвет = ВыборкаДетальныеЗаписи1.свет;
				Объект.СтГаз = ВыборкаДетальныеЗаписи1.Газ;
				Объект.СтВода = ВыборкаДетальныеЗаписи1.Вода;

			КонецЦикла;
		КонецЕсли;
	ИначеЕсли месяц(ДатаРасчета) = 12 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Услуги.Период КАК Период,
		|	Услуги.ДатаДокумента КАК ДатаДокумента,
		|	ЕСТЬNULL(Услуги.Газ, 0) КАК Газ,
		|	ЕСТЬNULL(Услуги.Свет, 0) КАК Свет,
		|	ЕСТЬNULL(Услуги.Вода, 0) КАК Вода
		|ИЗ
		|	РегистрСведений.Услуги КАК Услуги
		|ГДЕ
		|	МЕСЯЦ(Услуги.ДатаДокумента) = 11
		|	И ГОД(Услуги.ДатаДокумента) = ГОД(&ДатаДокумента)";

		Запрос.УстановитьПараметр("ДатаДокумента", ДатаРасчета);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Сообщить("данных за предыдущий период нет!!!запрос пустой");

		Иначе

			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				объект.СтСвет = ВыборкаДетальныеЗаписи.свет;
				Объект.СтГаз = ВыборкаДетальныеЗаписи.Газ;
				Объект.СтВода = ВыборкаДетальныеЗаписи.Вода;
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли месяц(ДатаРасчета) = 1 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Услуги.Период КАК Период,
		|	Услуги.ДатаДокумента КАК ДатаДокумента,
		|	ЕСТЬNULL(Услуги.Газ, 0) КАК Газ,
		|	ЕСТЬNULL(Услуги.Свет, 0) КАК Свет,
		|	ЕСТЬNULL(Услуги.Вода, 0) КАК Вода
		|ИЗ
		|	РегистрСведений.Услуги КАК Услуги
		|ГДЕ
		|	МЕСЯЦ(Услуги.ДатаДокумента) = 12
		|	И ГОД(Услуги.ДатаДокумента) = ГОД(&ДатаДокумента)-1";

		Запрос.УстановитьПараметр("ДатаДокумента", ДатаРасчета);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Сообщить("данных за предыдущий период нет!!!запрос пустой");

		Иначе

			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				объект.СтСвет = ВыборкаДетальныеЗаписи.свет;
				Объект.СтГаз = ВыборкаДетальныеЗаписи.Газ;
				Объект.СтВода = ВыборкаДетальныеЗаписи.Вода;
			КонецЦикла;
		КонецЕсли
		;

	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ПолучитьПуть(Команда)
	Каталог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Каталог.Фильтр = "MS Office|*.doc;*.docx;*.xls;*.xlsx|Все файлы (*.*)|*.*";
	Каталог.ИндексФильтра = 3; //укажем фильтр по умолчанию (нумерация с нуля)
	Если Каталог.Выбрать() Тогда
		Файл =  Каталог.ПолноеИмяФайла;
		Объект.ПутьКФайлу = Файл;
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ПолучитьПоказания(Команда)

	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);

	ПоказатьВопрос(Оповещение, "Подтвержаете? старые показания в текущем документе очистятся, безвозвратно!",
		РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Нет, // (необ.) кнопка по умолчанию

		"Вы уверены?" // (необ.) заголовок
	);
КонецПроцедуры
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда

		Сообщить("Создается новый объект");

	КонецЕсли;
КонецПроцедуры
&НаСервере
Процедура ЗагрузитьНаСервере1(файл)
	Эксель = Новый COMОбъект("Excel.Application");
	// открываем ексель файл
	Книга = Эксель.WorkBooks.Open(Файл);
	// переходим на первую страницу
	Лист = Книга.WorkSheets(1);
	Объект.СтГаз = Число(СокрЛП(Лист.Cells(1, 1).Value));
	Объект.НовГаз = Число(СокрЛП(Лист.Cells(1, 2).Value));
	Объект.СтСвет = Число(СокрЛП(Лист.Cells(1, 3).Value));
	Объект.НовСвет = Число(СокрЛП(Лист.Cells(1, 4).Value));
КонецПроцедуры

&НаКлиенте
Процедура Загрузить1(Команда)
	файл = Объект.ПутьКФайлу;
	ЗагрузитьНаСервере1(файл);
КонецПроцедуры
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтоАдресВременногоХранилища(СсылкаНаКартинку) Тогда
		ТекущийОбъект.ДанныеКартинки = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(СсылкаНаКартинку));
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура СчитатьИтог(Команда)
	ОтчетнаяДата = Объект.ДатаНачалаМесяца;
	Тарифы = ПолучитьТарифы(ОтчетнаяДата);

	ОбщегоНазначенияКлиент.ПересчитатьРазницыИСуммы(Объект, тарифы);
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры
&НаКлиенте
Процедура ОплаченоСветПриИзменении(Элемент)
	СтГазПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОплаченоВодаПриИзменении(Элемент)
	СтГазПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОплаченоМусорПриИзменении(Элемент)
	СтГазПриИзменении(Элемент);

КонецПроцедуры
&НаКлиенте
Процедура ПослеВыбораПояснения(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Попытка

		Объект.ДатаНачалаМесяца = Результат;
		ДатаНачалаМесяца = Объект.ДатаНачалаМесяца;
		МесяцСтрокой = ОбработкаДатыВыбора.ПолучитьПредставлениеМесяца(ДатаНачалаМесяца);
		ОтчетнаяДата = ОбработкаИсключенияМесяца();
		ЗаполнитьТарифы(ОтчетнаяДата);

	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура МесяцСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.ДатаНачалаМесяца) Тогда

		Возврат;
	КонецЕсли;
	ОчиститьСообщения();
	Объект.ДатаНачалаМесяца = НачалоМесяца(ДобавитьМесяц(Объект.ДатаНачалаМесяца, Направление));

	МесяцСтрокой = Формат(Объект.ДатаНачалаМесяца, "ДФ='MMMM гггг'") + " г.";
	ОтчетнаяДата = ОбработкаИсключенияМесяца();

	ЗаполнитьТарифы(ОтчетнаяДата);
	Текстпредупреждения = Новый ФорматированнаяСтрока(НСтр(
		"ru = 'Не забудьте, нажать кнопку получить старые показания, после изменения месяца!'"));

	ПоказатьПредупреждение( , Текстпредупреждения, , "Внимание!!!");

КонецПроцедуры

&НаКлиенте
Процедура МесяцСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОчиститьСообщения();
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораПояснения", ЭтаФорма);
	ОткрытьФорму("Документ.Услуги.Форма.ВыборПериода", , , , , , ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры
&НаКлиенте
Процедура ЗаполнитьТарифы(ОтчетнаяДата) Экспорт

	Тарифы = ПолучитьТарифы(ОтчетнаяДата);
	Если Не Тарифы = Неопределено Тогда
		Элементы.ТарифНагаз.Заголовок = "Тариф на Газ : " + Тарифы.ТарифНаГаз;
		Элементы.ТарифНаВоду.Заголовок = "Тариф на Воду : " + Тарифы.ТарифНаВоду;
		Элементы.ТарифНаЭлектроэнергию.Заголовок = "Тариф на электроэнергию : " + Тарифы.ТарифНаЭлектроэнергию;
		Элементы.ТарифНаМусор.Заголовок = "Тариф на мусор : " + Тарифы.ТарифНаМусор;
		Элементы.ТарифНаИнтернет.Заголовок = "Тариф интернета : " + Тарифы.ТарифНаИнтернет;
	КонецЕсли;
КонецПроцедуры // ЗаполнитьТарифы()
&НаКлиенте
Функция ОбработкаИсключенияМесяца()

	Дата12месяца= Дата(Год(Объект.Дата), 01, 01);
	ОтчетнаяДата = ?(месяц(Объект.ДатаНачалаМесяца) = 12, Дата12месяца, Объект.ДатаНачалаМесяца);
	Возврат ОтчетнаяДата;
КонецФункции;
